ConCards_back/src/AccumulationRegisters/ОстаткиНаСчетах/ОстаткиНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСчетах</name>
  <resources>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConCards_back/src/Catalogs/Продукты/Продукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Продукты</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>EnumRef.ТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConCards_back/src/HTTPServices/ОперацииСПродуктами/Module.bsl
#Область ОбработчикиСобытий

Функция ШаблонURLПучитьСписокПродуктов(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Параметры = Запрос.ПараметрыURL;
	Попытка
		Владелец = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.Получить("id")));
	Исключение   
		Ответ.КодСостояния = 400;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		МассивПродуктов = Новый	Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ОстаткиНаСчетахОстатки.БалансОстаток, 0) КАК БалансОстаток,
			|	Продукты.Код КАК Код,
			|	Продукты.Наименование КАК Наименование,
			|	ПРЕДСТАВЛЕНИЕ(Продукты.ТипПродукта) КАК ТипПродукта,
			|	ПРЕДСТАВЛЕНИЕ(Продукты.Банк) КАК Банк
			|ИЗ
			|	Справочник.Продукты КАК Продукты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНаСчетах.Остатки(, Пользователь = &Пользователь) КАК ОстаткиНаСчетахОстатки
			|		ПО ОстаткиНаСчетахОстатки.Счет = Продукты.Ссылка";
		
		Запрос.УстановитьПараметр("Пользователь", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Продукт = Новый Структура;
				Продукт.Вставить("Код", 			Выборка.Код);
				Продукт.Вставить("Наименование", 	Выборка.Наименование);
				Продукт.Вставить("ТипПродукта", 	Выборка.ТипПродукта);
				Продукт.Вставить("Банк", 			Выборка.Банк);
				Продукт.Вставить("Баланс", 			Выборка.БалансОстаток);
		
				МассивПродуктов.Добавить(Продукт);	
			КонецЦикла;
		Иначе
			Ответ.КодСостояния = 204;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура("Products", МассивПродуктов);
	СериализаватьВJSON(ДанныеВозврата);
	Ответ.УстановитьТелоИзСтроки(ДанныеВозврата);

	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СериализаватьВJSON(Данные)
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	
	Данные = Запись.Закрыть();
	
КонецПроцедуры

#КонецОбласти
